Revit 2026 API

# GenericZoneRemoveSpaces Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveSpaces(
	ISet<ElementId> spaceIds
)
```
```vb
Public Sub RemoveSpaces (
	spaceIds As ISet(Of ElementId)
)
```
```cpp
public:
void RemoveSpaces(
	ISet<ElementId^>^ spaceIds
)
```
```fsharp
member RemoveSpaces :
        spaceIds : ISet<ElementId> -> unit
```

#### Parameters

spaceIds ISetElementId

#### Reference

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace